---
kind: property
id: P:Autodesk.Revit.UI.UIApplication.IsViewerModeActive
source: html/b5247639-12ba-784e-2683-a1954e382da8.htm
---
# Autodesk.Revit.UI.UIApplication.IsViewerModeActive Property

Determines if Revit session is in Viewer mode.

## Syntax (C#)
```csharp
public bool IsViewerModeActive { get; }
```